In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

In [3]:
df = pd.read_csv(r'C:\Users\kumar\Desktop\business category\Business-Classification\Business Dataset\dummy_commercial_businesses.csv')

In [4]:
df.head()

         Business Name                   CII Category
0  First National Bank     Banking/Financial Services
1    Greenhill Academy                      Education
2        Regal Cinemas  Entertainment/Public Assembly
3            Pizza Hut         Food Sales and Service
4       Mercy Hospital                     Healthcare

In [5]:
df.shape

(30, 2)

In [6]:
df.isna().sum()

Business Name    0
CII Category     0
dtype: int64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Business Name  30 non-null     object
 1   CII Category   30 non-null     object
dtypes: object(2)
memory usage: 608.0+ bytes

In [8]:
df.nunique()

Business Name    30
CII Category     21
dtype: int64

In [9]:
df.describe()

              Business Name                CII Category
count                    30                          30
unique                   30                          21
top     First National Bank  Banking/Financial Services
freq                      1                           2